frontend/controllers/SiteController.php

SELECT * FROM `simp_article` WHERE 0=1
---
    public function actionIndex($categoryId = null)
    {
        if ($categoryId) {
            /** @var ArticleCategoryRecord $category */
            $category = ArticleCategoryRecord::findOne($categoryId);
            $subcategories = $category->subcategories;
            $articles = $category->articles;
        } else {
            $subcategories = ArticleCategoryRecord::findRootCategories();
            $articles = [];//ArticleRecord::findWithoutCategory();