common/models/article/ArticleCategoryRecord.php

SELECT * FROM `simp_article_category` WHERE `parent_id` IS NULL
---
    public static function findRootCategories()
    {
        return static::findAll(['parent_id' => null]);