common/models/article/ArticleRecord.php

    public function beforeSave($insert)
    {

        foreach ($this->tags_ids as $tag) {
            if (!is_numeric($tag)) {
                $newTag = new ArticleTagRecord();
                $newTag->name = $tag;
                if ($newTag->save()) {
---
INSERT INTO `simp_article_tag` (`name`, `slug`) VALUES ('dfafds', 'dfafds')